IPSmallJava/TestObjectBuilder/Tests_Template/Common/Step05.xml

<ns1:Envelope
    xmlns:ns2="urn:liberty:paos:2003-08"
    xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ns3="urn:liberty:paos:2006-08"
    xmlns:ns5="http://www.w3.org/2005/03/addressing">
  <ns1:Header>
    <ns5:MessageID>urn:{0}</ns5:MessageID>
    <ns5:ReplyTo>
      <ns5:Address>https://{8}</ns5:Address>
    </ns5:ReplyTo>
    <ns5:RelatesTo>{9}</ns5:RelatesTo>
    <ns5:Action>http://www.bsi.bund.de/ecard/api/1.0/PAOS/GetNextCommand</ns5:Action>
  </ns1:Header>
  <ns1:Body>
  <iso:CardApplicationEndSession
	xmlns:ecdsa="http://www.w3.org/2001/04/xmldsig-more#" xmlns:olsc="http://www.openlimit.com/ecard/api/ext/acbc"
	xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:iso="urn:iso:std:iso-iec:24727:tech:schema"
	xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion"
	xmlns:vr="urn:oasis:names:tc:dss-x:1.0:profiles:verificationreport:schema#"
	xmlns:dss="urn:oasis:names:tc:dss:1.0:core:schema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
	xmlns:dsse="urn:oasis:names:tc:dss-x:1.0:profiles:encryption:schema#"
	xmlns:ec="http://www.bsi.bund.de/ecard/api/1.1" xmlns:tsl="http://uri.etsi.org/02231/v2#"
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:XAdES="http://uri.etsi.org/01903/v1.3.2#"
	xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:dssades="urn:oasis:names:tc:dss:1.0:profiles:AdES:schema#"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:dssx="urn:oasis:names:tc:dss-x:1.0:profiles:SignaturePolicy:schema#"
	xmlns:ers="http://www.setcce.org/schemas/ers" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<iso:ConnectionHandle xsi:type="iso:ConnectionHandleType">
		<iso:SlotHandle>{1}
		</iso:SlotHandle>
	</iso:ConnectionHandle>
</iso:CardApplicationEndSession>
</ns1:Body>
</ns1:Envelope>
